results/bun/vercube.txt
Bundle: 561.1 KB
Startup: 37.3 ms
Memory before: 42.2 MB

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/
Bombarding http://127.0.0.1:3000/ for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    127856.23   20265.21  156079.37
  Latency        3.94ms     2.31ms   127.72ms
  HTTP codes:
    1xx - 0, 2xx - 1268049, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    22.97MB/s

bombardier --fasthttp -c 500 -d 10s http://127.0.0.1:3000/id/1?name=bun
Bombarding http://127.0.0.1:3000/id/1?name=bun for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    119859.25    5569.99  163272.80
  Latency        4.17ms   782.99us    95.52ms
  HTTP codes:
    1xx - 0, 2xx - 1199005, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    23.55MB/s

bombardier --fasthttp -c 500 -d 10s -m POST -H Content-Type:application/json -f ./scripts/body.json http://127.0.0.1:3000/json
Bombarding http://127.0.0.1:3000/json for 10s using 500 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec    108729.55    3837.42  133230.49
  Latency        4.60ms   490.03us    73.53ms
  HTTP codes:
    1xx - 0, 2xx - 1087748, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:    27.89MB/s

bombardier --fasthttp -c 10 -d 10s -H Cache-Control:no-store -H If-None-Match:"benchmark-force-full-response" http://127.0.0.1:3000/video
Bombarding http://127.0.0.1:3000/video for 10s using 10 connection(s)
 10s
Done!
Statistics        Avg      Stdev        Max
  Reqs/sec       579.79     130.57     891.82
  Latency       17.22ms     5.83ms    60.52ms
  HTTP codes:
    1xx - 0, 2xx - 5809, 3xx - 0, 4xx - 0, 5xx - 0
    others - 0
  Throughput:     7.64GB/s

Memory after: 71.0 MB